In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

# Data Alignment

In [2]:
ser1 = Series([1,2,3],index=['A','B','C'])
ser2 = Series([3,4,5,6],index=['A','B','C','D'])

In [3]:
ser1 + ser2

A    4.0
B    6.0
C    8.0
D    NaN
dtype: float64

In [4]:
# Note the list('AB'), that can help save time
dframe = DataFrame(np.arange(4).reshape((2,2)),columns=list('AB'),index=['NYC','LA'])
dframe

     A  B
NYC  0  1
LA   2  3

In [5]:
dframe2 = DataFrame(np.arange(9).reshape((3,3)),columns=list('ADC'),index=['NYC','SF','LA'])
dframe2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [6]:
dframe + dframe2

       A   B   C   D
LA   8.0 NaN NaN NaN
NYC  0.0 NaN NaN NaN
SF   NaN NaN NaN NaN

In [7]:
dframe.add(dframe2,fill_value=0)

       A    B    C    D
LA   8.0  3.0  8.0  7.0
NYC  0.0  1.0  2.0  1.0
SF   3.0  NaN  5.0  4.0

In [8]:
ser3 = dframe2.iloc[0]
ser3

A    0
D    1
C    2
Name: NYC, dtype: int64

In [9]:
dframe2-ser3

     A  D  C
NYC  0  0  0
SF   3  3  3
LA   6  6  6

# Rank and Sort

In [10]:
ser1 = Series([1,2,3],index=['C','A','B'])
ser1

C    1
A    2
B    3
dtype: int64

In [11]:
ser1.sort_index()

A    2
B    3
C    1
dtype: int64

In [12]:
ser1.sort_values()

C    1
A    2
B    3
dtype: int64

In [13]:
ser2 = Series(np.random.randn(9))
ser2

0   -1.167546
1   -1.477461
2    0.761045
3   -0.084914
4    0.517274
5    0.126522
6    0.268156
7   -0.773089
8   -0.919292
dtype: float64

In [14]:
ser2.rank()

0    2.0
1    1.0
2    9.0
3    5.0
4    8.0
5    6.0
6    7.0
7    4.0
8    3.0
dtype: float64

In [15]:
ser2.sort_values()

1   -1.477461
0   -1.167546
8   -0.919292
7   -0.773089
3   -0.084914
5    0.126522
6    0.268156
4    0.517274
2    0.761045
dtype: float64

In [16]:

ser2

0   -1.167546
1   -1.477461
2    0.761045
3   -0.084914
4    0.517274
5    0.126522
6    0.268156
7   -0.773089
8   -0.919292
dtype: float64